Reproduced this bug with this config:

```terraform
provider "gitlab" {
  token    = "ACCTEST"
  base_url = "http://localhost:8080/api/v4"
}

resource "gitlab_group" "example" {
  name = "Example Group"
  path = "example-group"
}

resource "gitlab_project" "example" {
  name = "My Project"
}

resource "gitlab_project_share_group" "example" {
  access_level = "developer"
  group_id     = gitlab_group.example.id
  project_id   = gitlab_project.example.id
}
```

Commandline:

```shell
❯ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # gitlab_group.example will be created
  + resource "gitlab_group" "example" {
      + full_name              = (known after apply)
      + full_path              = (known after apply)
      + id                     = (known after apply)
      + lfs_enabled            = true
      + name                   = "Example Group"
      + parent_id              = 0
      + path                   = "example-group"
      + request_access_enabled = false
      + runners_token          = (sensitive value)
      + visibility_level       = (known after apply)
      + web_url                = (known after apply)
    }

  # gitlab_project.example will be created
  + resource "gitlab_project" "example" {
      + approvals_before_merge                           = 0
      + archived                                         = false
      + container_registry_enabled                       = true
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + issues_enabled                                   = true
      + lfs_enabled                                      = true
      + merge_method                                     = "merge"
      + merge_requests_enabled                           = true
      + name                                             = "My Project"
      + namespace_id                                     = (known after apply)
      + only_allow_merge_if_all_discussions_are_resolved = false
      + only_allow_merge_if_pipeline_succeeds            = false
      + pipelines_enabled                                = true
      + request_access_enabled                           = true
      + runners_token                                    = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_enabled                                 = true
      + ssh_url_to_repo                                  = (known after apply)
      + visibility_level                                 = "private"
      + web_url                                          = (known after apply)
      + wiki_enabled                                     = true
    }

  # gitlab_project_share_group.example will be created
  + resource "gitlab_project_share_group" "example" {
      + access_level = "developer"
      + group_id     = (known after apply)
      + id           = (known after apply)
      + project_id   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

gitlab_group.example: Creating...
gitlab_project.example: Creating...
gitlab_group.example: Creation complete after 1s [id=9]
gitlab_project.example: Creation complete after 1s [id=9]
gitlab_project_share_group.example: Creating...
gitlab_project_share_group.example: Creation complete after 0s [id=9:9]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.


❯ terraform apply
gitlab_group.example: Refreshing state... [id=9]
gitlab_project.example: Refreshing state... [id=9]
gitlab_project_share_group.example: Refreshing state... [id=9:9]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # gitlab_project.example will be updated in-place
  ~ resource "gitlab_project" "example" {
        approvals_before_merge                           = 0
        archived                                         = false
        container_registry_enabled                       = true
        http_url_to_repo                                 = "http://9818f6cbb506/root/my-project.git"
        id                                               = "9"
        issues_enabled                                   = true
        lfs_enabled                                      = true
        merge_method                                     = "merge"
        merge_requests_enabled                           = true
        name                                             = "My Project"
        namespace_id                                     = 1
        only_allow_merge_if_all_discussions_are_resolved = false
        only_allow_merge_if_pipeline_succeeds            = false
        path                                             = "my-project"
        pipelines_enabled                                = true
        remove_source_branch_after_merge                 = false
        request_access_enabled                           = true
        runners_token                                    = "F2CUcsQj-TmsN1AbjFx3"
        shared_runners_enabled                           = false
        snippets_enabled                                 = true
        ssh_url_to_repo                                  = "git@9818f6cbb506:root/my-project.git"
        tags                                             = []
        visibility_level                                 = "private"
        web_url                                          = "http://9818f6cbb506/root/my-project"
        wiki_enabled                                     = true

      - shared_with_groups {
          - group_access_level = "developer" -> null
          - group_id           = 9 -> null
          - group_name         = "Example Group" -> null
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

gitlab_project.example: Modifying... [id=9]
gitlab_project.example: Modifications complete after 0s [id=9]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.


❯ terraform apply
gitlab_group.example: Refreshing state... [id=9]
gitlab_project.example: Refreshing state... [id=9]
gitlab_project_share_group.example: Refreshing state... [id=9:9]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```